# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import pandas as pd
import numpy as np
import scipy.stats as st

# Challenge 1 - Exploring the Data

#### In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [2]:
# Your code here:
data = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')
display(data.shape)
display(data.head())
display(data.tail())

(33702, 8)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
33697,"ZYLINSKA, KLAUDIA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33698,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
33699,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33700,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33701,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DAIS,F,Salary,NaN,126732.0,NaN

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33702 entries, 0 to 33701
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               33702 non-null  object
 1   Job Titles         33702 non-null  object
 2   Department         33702 non-null  object
 3   Full or Part-Time  33702 non-null  object
 4   Salary or Hourly   33702 non-null  object
 5   Typical Hours      8174 non-null   float64
 6   Annual Salary      25528 non-null  float64
 7   Hourly Rate        8174 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.1+ MB

In [4]:
def standardize_header(dataframe):
    dataframe.columns = [c.lower().replace(' ', '_') for c in dataframe.columns]

standardize_header(data)

In [5]:
data.columns

Index(['name', 'job_titles', 'department', 'full_or_part-time',
       'salary_or_hourly', 'typical_hours', 'annual_salary', 'hourly_rate'],
      dtype='object')

In [6]:
data.isna().sum()

name                     0
job_titles               0
department               0
full_or_part-time        0
salary_or_hourly         0
typical_hours        25528
annual_salary         8174
hourly_rate          25528
dtype: int64

#### Examine the `salaries` dataset using the `head` function below.

In [7]:
# Your code here:
data.head()

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

#### We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [8]:
# Your code here:
data.isna().sum()

name                     0
job_titles               0
department               0
full_or_part-time        0
salary_or_hourly         0
typical_hours        25528
annual_salary         8174
hourly_rate          25528
dtype: int64

#### Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [9]:
# Your code here:
data['salary_or_hourly'].value_counts()

Salary    25528
Hourly     8174
Name: salary_or_hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

#### There are different departments in the city. List all departments and the count of employees in each department.

In [10]:
# Your code here:
df = data.pivot_table(index = ['department'], values=['name'], aggfunc= {'name': 'count'})
df.rename(columns = {'name' : 'Number of Employees'}, inplace = True)
df

                     Number of Employees
department
ADMIN HEARNG                          38
ANIMAL CONTRL                         75
AVIATION                            1856
BOARD OF ELECTION                    111
BOARD OF ETHICS                        8
BUDGET & MGMT                         44
BUILDINGS                            258
BUSINESS AFFAIRS                     167
CITY CLERK                            88
CITY COUNCIL                         362
COPA                                 123
CULTURAL AFFAIRS                      74
DAIS                                1033
DISABILITIES                          28
FAMILY & SUPPORT                     656
FINANCE                              544
FIRE                                4627
HEALTH                               467
HOUSING                               66
HOUSING & ECON DEV                   154
HUMAN RELATIONS                       17
HUMAN RESOURCES                       75
INSPECTOR GEN                         95
LAW                                  398
LICENSE APPL COMM                      1
MAYOR'S OFFICE                       104
OEMC                                1737
POLICE                             13848
POLICE BOARD                           2
PROCUREMENT                           84
PUBLIC LIBRARY                      1088
PUBLIC SAFETY ADMIN                  244
STREETS & SAN                       2175
TRANSPORTN                          1113
TREASURER                             28
WATER MGMNT                         1914

# Challenge 2 - Hypothesis Tests

#### In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [11]:
#Hypothesis:
#H0 is that the hourly salary is equal to 30$
#H1 is that the hourly salary is significantly different from 30$

In [12]:
data['hourly_rate'].isna().sum()

25528

In [13]:
#I drop the nan values here

In [14]:
data_drop = data['hourly_rate'].dropna()

In [15]:
data_drop.isna().sum()

0

In [16]:
# Your code here:
import scipy.stats 
from scipy import stats
hourly_rate = data_drop
confidence_level = 0.95
degrees_freedom = len(hourly_rate) - 1 
sample_mean = np.mean(hourly_rate)
sample_standard_error = scipy.stats.sem(hourly_rate) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [17]:
print( 'confidence interval is ', confidence_interval, '.' )

confidence interval is  (34.29839539204361, 34.874504045197305) .

In [18]:
from scipy.stats import ttest_1samp
stat, pval = ttest_1samp(data_drop, 30)

In [19]:
print('stat is  ', stat)
print('pvalue for the two-tailed test is ', pval)

stat is   31.211500329216044
pvalue for the two-tailed test is  3.825475847673794e-202

In [20]:
#The 30$/hr salary is outside our confidence interval from more than 10 % with 95 % certainty. As we can observe in stat.

In [21]:
#From the analysis I can conclude that we don't have enough evidence to support H0
#therefore we reject the Null Hypothesis because the pvalue is less than 0.05, which was our significance value. 
#So yes, the hourly wage of all hourly workers is significantly different from $30/hr.

#### We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

#### Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [22]:
#Hypothesis:
#H0 is that the annual salary for the police department is less than or equal 86 k $
#H1 is that the annual salary for the police department is higher than 86 k $

In [23]:
data_police = data[(data['department'] == 'POLICE') & (data['annual_salary'].isnull() == False)]

In [24]:
data_police

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
6,"AGNEW, MELISSA M",SERGEANT,POLICE,F,Salary,NaN,111444.0,NaN
7,"AGOSTA, JOSEPH J",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,103932.0,NaN
9,"AGOSTINI, LUIS R",ASST DIR,POLICE,F,Salary,NaN,95736.0,NaN
...,...,...,...,...,...,...,...,...
33696,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,80016.0,NaN
33697,"ZYLINSKA, KLAUDIA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33698,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
33699,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33700,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

In [25]:
df1 = data_police['annual_salary']

In [26]:
df1

1         93354.0
4         90024.0
6        111444.0
7        103932.0
9         95736.0
           ...
33696     80016.0
33697     72510.0
33698     76266.0
33699     90024.0
33700     93354.0
Name: annual_salary, Length: 13824, dtype: float64

In [27]:
df1.isna().sum()

0

In [28]:
# Your code here:
annual_salary = df1
confidence_level = 0.95
degrees_freedom = len(annual_salary) - 1 
sample_mean = np.mean(annual_salary)
sample_standard_error = scipy.stats.sem(annual_salary) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [29]:
print( 'confidence interval is ', confidence_interval, '.' )

confidence interval is  (88534.1182885883, 89134.11955863392) .

In [30]:
from scipy.stats import ttest_1samp
stat, pval = ttest_1samp(df1, 86000)

In [31]:
print('stat is  ', stat)
print('pvalue for the one-tailed test is ', pval/2)

stat is   18.51748561981861
pvalue for the one-tailed test is  6.119566952121482e-76

In [32]:
#We can reject the null hypothesis that annual salaries in the police dep. are less than or equal to 86k.because the pvalue is less than 0.05
#We can say they are higher because t-stat is also positive and our confidence interval is between 88.5 and 89.1 k, 95 % sure.

#### Using the `crosstab` function, find the department that has the most hourly workers.

In [33]:
# Your code here:
data_crosstab = pd.crosstab(data['department'], data['salary_or_hourly'], margins = False)
data_crosstab[data_crosstab['Hourly'] == data_crosstab['Hourly'].max()]

salary_or_hourly  Hourly  Salary
department
STREETS & SAN       1846     329

#### The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [34]:
#Hypothesis:
#H0 is that the hourly wage for the STREETS & SAN department is higher than or equal to 35$/hr
#H1 is that the hourly wage for the STREETS & SAN department is less than 35$/hr

In [35]:
# Your code here:
data_dep = data[(data['department'] == 'STREETS & SAN') & (data['hourly_rate'].isnull() == False)]

In [36]:
data_dep

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
15,"AGSALUD, FERNAN S",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,40.78
16,"AGSALUD JR, JUANITO S",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,38.52
26,"AGUILAR, EFRAIN",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,38.52
49,"ABDUL-SHAKUR, TAHIR J",POOL MOTOR TRUCK DRIVER,STREETS & SAN,P,Hourly,10.0,NaN,29.96
65,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,37.45
...,...,...,...,...,...,...,...,...
33623,"ZIZUMBO, JOSE N",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,38.01
33624,"ZIZUMBO, LUIS",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,37.45
33667,"ZUMMO, ROBERT J",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,37.45
33668,"ZUNICH, JONATHAN G",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,38.52
33676,"ZUNIGA, THOMAS",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,25.95

In [37]:
df2 = data_dep['hourly_rate']
df2

15       40.78
16       38.52
26       38.52
49       29.96
65       37.45
         ...
33623    38.01
33624    37.45
33667    37.45
33668    38.52
33676    25.95
Name: hourly_rate, Length: 1846, dtype: float64

In [38]:
df2.isna().sum()

0

In [39]:
hourly_rate2 = df2
confidence_level = 0.95
degrees_freedom = len(hourly_rate2) - 1 
sample_mean = np.mean(hourly_rate2)
sample_standard_error = scipy.stats.sem(hourly_rate2) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [40]:
print( 'confidence interval is ', confidence_interval, '.' )

confidence interval is  (35.28150811892018, 35.82308559722106) .

In [41]:
from scipy.stats import ttest_1samp
stat, pval = ttest_1samp(df2, 35)

In [42]:
print('stat is  ', stat)
print('pvalue for the one-tailed test is ', pval/2)

stat is   4.000138803968834
pvalue for the one-tailed test is  3.2902372218867895e-05

In [43]:
#We accept the null hypothesis that hourly wage for the STREETS & SAN dep. are higher than 35$/hr. 
#we reject the equal part because the pvalue is less than 0.05. We also reject H1. 
#We can say they are higher because t-stat is also positive and our confidence interval is between 35.2 and 35.82 $/hr, 95 % sure.

# Challenge 3: To practice - Constructing Confidence Intervals

#### While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 


#### To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


#### In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

#### The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

#### To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [44]:
# Your code here:
hourly_rate = data_drop
confidence_level = 0.95
degrees_freedom = len(hourly_rate) - 1 
sample_mean = np.mean(hourly_rate)
sample_standard_error = scipy.stats.sem(hourly_rate) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [47]:
print( 'confidence interval is ', confidence_interval, '.' )

confidence interval is  (34.29839539204361, 34.874504045197305) .

#### Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [48]:
# Your code here:
annual_salary = df1
confidence_level = 0.95
degrees_freedom = len(annual_salary) - 1 
sample_mean = np.mean(annual_salary)
sample_standard_error = scipy.stats.sem(annual_salary) 
confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [49]:
print( 'confidence interval is ', confidence_interval, '.' )

confidence interval is  (88534.1182885883, 89134.11955863392) .

# Bonus Challenge - Hypothesis Tests of Proportions

#### Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

#### You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

#### In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [ ]:
#Hypothesis:
#H0 is that the number of hourly workers is equal to 25 % of the total workers. 
#H1 is that the number of hourly workers is NOT equal to 25 % of the total workers.

In [55]:
# Your code here:
from statsmodels.stats.proportion import proportions_ztest
total = len(data)
hourly_workers = len(data_drop)
proportions_ztest(hourly_workers, total, value=.25)

(-3.1962453870335, 0.0013922864704323116)

In [ ]:
#We can reject the Null Hypothesis H0 which states that the porportion of workers is equal to 25 % . pvalue less than 0.05. 
#It may be less due to the stat value, but Im not sure of this point.